#### ElementId Constructor (Int32)

---

|  |
| --- |
| ElementId Class   See Also |

Create an ElementId handle with the given integer id.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ElementId( 	int id ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	id As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ElementId( 	int id ) ``` |

#### Parameters

id
:   Type:  System Int32
     The id.

# See Also

ElementId Class

ElementId Overload

Autodesk.Revit.DB Namespace